backend/Catalogs/ПроизвольныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПроизвольныеФайлы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапуститьПосле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>История</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/Catalogs/ПроизвольныеФайлы/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	    ЭтаФорма.Записать();
		ЭтаФорма.Прочитать();
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.МножественныйВыбор = Ложь;
		Диалог.Заголовок = "Выберите файл";
		Диалог.Показать(Новый ОписаниеОповещения("ПолучитьОтвет", ЭтаФорма, Новый Структура("Диалог", Диалог)));
		ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьОтвет(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Диалог = ДополнительныеПараметры.Диалог;
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		    ФайлДляЗаписи = Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла);
			ЗаписьФайлаСУБД(Диалог.ПолноеИмяФайла, ФайлДляЗаписи);
			
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаписьФайлаСУБД(ПутьКФайлу, ФайлДляЗаписи)
	    НашОбъект = РеквизитФормыВЗначение("Объект");
		Сжатие = Новый СжатиеДанных(9);
		НашОбъект.ПутьКФайлу = ПутьКФайлу;
		НашОбъект.Файл = Новый ХранилищеЗначения(ФайлДляЗаписи, Сжатие);
		НашОбъект.История.Добавить();
		НашОбъект.История[НашОбъект.История.Количество() - 1].ДатаЗагрузки = ТекущаяДата();
		НашОбъект.Наименование = ЭтотОбъект.Объект.Наименование;				
		 	ИсхСтрока = НашОбъект.ПутьКФайлу;
			Поз = Найти(ИсхСтрока, "\");
			ПозК = 0;
			Пока Поз <> 0 Цикл
				ПозК = ПозК + Поз;
				ИсхСтрока = Сред(ИсхСтрока, Поз+1);
				Поз = Найти(ИсхСтрока, "\");
			КонецЦикла;    
			НашОбъект.ИмяФайла = Сред(НашОбъект.ПутьКФайлу, ПозК + 1);
		НашОбъект.История[НашОбъект.История.Количество() - 1].ИмяФайла = НашОбъект.ИмяФайла;
		ЭтотОбъект.Объект.ИмяФайла = НашОбъект.ИмяФайла;

		Если Не ЗначениеЗаполнено(НашОбъект.Наименование) Тогда 
			  НашОбъект.Наименование =  НашОбъект.ИмяФайла;
		КонецЕсли;
			
		
		НашОбъект.Записать();
		Сообщить("Файл " + ЭтотОбъект.Объект.ИмяФайла + " успешно записан в базу данных.");
	
	КонецПроцедуры 

	&НаКлиенте
	Процедура ВыгрузитьФайл(Команда)
		
		#Если ВебКлиент Тогда 
			СтандартнаяОбработка = Ложь;
			Файл = Новый Файл(Объект.ИмяФайла);
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = Объект.Файл;
			ДвоичныеДанные.Записать(ИмяФайла);

			ЗапуститьПриложение(ИмяФайла);
			Возврат;
		#КонецЕсли 
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.МножественныйВыбор = Ложь;
		Диалог.Заголовок = "Выберите место сохранения файла";
		Диалог.ПолноеИмяФайла = Объект.ИмяФайла;

		Диалог.Показать(Новый ОписаниеОповещения("ПолучитьОтветСохранения", ЭтаФорма, Новый Структура("Диалог", Диалог)));

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтветСохранения(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
Диалог = ДополнительныеПараметры.Диалог;
Если (ВыбранныеФайлы <> Неопределено) Тогда
	
ПутьКФайлу = ДополнительныеПараметры.Диалог.ПолноеИмяФайла;
ЗаписьИзСУБДнаДиск(ПутьКФайлу)
	
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписьИзСУБДнаДиск(ПутьКФайлу)
НашОбъект = РеквизитФормыВЗначение("Объект");
ФайлДляЗаписи = НашОбъект.Ссылка.Файл.Получить();
		ФайлДляЗаписи.Записать(ПутьКФайлу);
		Если Объект.ЗапуститьПосле = Истина Тогда
			ЗапуститьПриложение(ПутьКФайлу); 
		КонецЕсли;
	
КонецПроцедуры
